const a = "це змінна а"
const d = "змінна d"

if(5 < 7) {
    const b = "змінна б"
    console.log(b)
    console.log(a)
    const d = "змінна d2"
    // console.log(c)
    if (5<10){
        const c = "змінна с"
        console.log(c)

    console.log(d)
        // for (){

        }
    }
// }5
console.log(a);



// Напиши скрипт вибору готеля по кількості зірок.
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
//  Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
//  'Токої кількості зірок немає'

let strasHotel
const hotelPryse = prompt("Веведіть кількість зірок та ми вам покажемо їхню ціну")

switch(hotelPryse) {
    case "1":
        strasHotel = "20$";
        break;
    case "2":
        strasHotel = "30$";
        break;
    case  "3":
        strasHotel = "50$";
        break;
    case "4":
        strasHotel = "70$"
        break;
    case "5":
        strasHotel = "120$"
        break;
    default:
         alert("Такої кількості зірок немає")
}

alert(`Ціна за готель який ви обрали становить ${strasHotel}`)


// Напиши скрипт вибору опції доставки товару. 
// Опція зберігається в змінній option: 1 - самовивіз, 
// 2 - кур"єр, 3 - пошта. В змінну message записати 
// повідомлення в залежності від опції.
//  - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//  - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'

const optionDaliver = parseInt(
    prompt ("оберіть спосіб доставки: 1 - самовивіз, 2 - курєр, 3 - пошта. ")
);


const option = parseInt(
    prompt("Оберіть спосіб доставки: 1 - самовивіз, 2 - кур'єр, 3 - пошта.")
  );
  let message = "";
  // * Тернарний оператор розгалуження
  message =
    option === 1
      ? "Ви зможете забрати товар завтра з 12:00 в нашому офісі"
      : option === 2
      ? "Кур'єр доставить замовлення завтра з 9:00 до 18:00"
      : option === 3
      ? "Ви зможете забрати замовлення на пошті"
      : "Такого способу доставки нема";
  alert(message);
  // * Switch оператор розгалуження
  switch (option) {
    case 1:
      message = "Ви зможете забрати товар завтра з 12:00 в нашому офісі";
      break;
    case 2:
      message = "Кур'єр доставить замовлення завтра з 9:00 до 18:00";
      break;
    case 3:
      message = "Ви зможете забрати замовлення на пошті";
      break;
    default:
      message = "Такого способу доставки нема";
  }
  alert(message);